# `brew bundle install` to use this Brewfile
tap "homebrew/bundle"

# Terminal icons
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# Development
brew "neovim"
brew "stow"
brew "tmux"
brew "watch"
brew "wget"
brew "nmap"
brew "zsh"
brew "hurl"
cask "docker"

brew "python@3.11"
brew "python@3.10"
brew "virtualenv"
brew "go"
brew "node"
brew "testssl"

#AWS
cask "session-manager-plugin"
brew "awscli"
brew "weaveworks/tap/eksctl"

# Hashicorp
tap "hashicorp/tap"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "terraform-docs"

# search and look at files efficiently
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jinja2-cli"
brew "jq"
brew "catimg"
brew "tree"
brew "yq"

# git
brew "gh"
brew "git-filter-repo"
brew "gitleaks"
brew "pre-commit"
brew "git-crypt"

# otp
brew "oath-toolkit"

# kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
tap "weaveworks/tap"

# lsp
brew "viu"
brew "shellcheck"
brew "shfmt"
brew "hashicorp/tap/terraform-ls"
brew "tflint"
brew "efm-langserver"
brew "stylua"

# apps
cask "alacritty", args: { no_quarantine: true }
cask "obsidian"
cask "drawio"
